<a href="https://colab.research.google.com/github/Ananassio/Data-Science_lab/blob/main/week_3/Assignment_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# EX3: Some Statistics with Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [74]:
#get data from GitHub -> https://github.com/keuperj/DATA
!git clone https://github.com/keuperj/DATA.git

fatal: destination path 'DATA' already exists and is not an empty directory.

In [75]:
import pandas as pd
import numpy as np

### Step 2. 
User ***Jupyter Lab*** to view ``../../DATA/US_Baby_Names_right.csv'``.

### Step 3. Assign it to a variable called baby_names.

In [76]:
baby_names = pd.read_csv('DATA/US_Baby_Names_right.csv')

### Step 4. See the first 10 entries

In [77]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [78]:
baby_names = baby_names.drop(['Unnamed: 0', 'Id'], 1)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  """Entry point for launching an IPython kernel.

### Step 6. Are there more male or female names in the dataset?

In [79]:
baby_names['Gender'].value_counts()#.argsort()

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [85]:
grouped = baby_names.groupby(baby_names['Name'])
grouped.head()
grouped.get_group('Emily')

          Name  Year Gender State  Count
4        Emily  2004      F    AK     41
206      Emily  2005      F    AK     47
419      Emily  2006      F    AK     42
640      Emily  2007      F    AK     43
844      Emily  2008      F    AK     36
...        ...   ...    ...   ...    ...
1013872  Emily  2010      F    WY     13
1013992  Emily  2011      F    WY     16
1014126  Emily  2012      F    WY     14
1014226  Emily  2013      F    WY     21
1014429  Emily  2014      F    WY      7

[565 rows x 5 columns]

### Step 8. How many different names exist in the dataset?

In [81]:
baby_names['Name'].value_counts().count()

17632

### Step 9. What is the name with most occurrences?

In [82]:
baby_names['Name'].value_counts().keys()[0]

'Riley'

### Step 10. How many different names have the least occurrences?

In [198]:
#grouped.count()['Count']
#grouped['Name'].nsmallest(2,'Name', keep = 'all')
#baby_names.nsmallest(2,'Name')
#baby_names['Name'].count(baby_names['Name'].value_counts()==1)

#temp = baby_names['Name'].value_counts()*-1
#temp.head()

### Step 11. What is the median name occurrence?

In [169]:
grouped['Count'].median()

Name
Aaban       6.0
Aadan       5.5
Aadarsh     5.0
Aaden      10.0
Aadhav      6.0
           ...
Zyra        6.0
Zyrah       5.5
Zyren       6.0
Zyria       6.0
Zyriah      6.0
Name: Count, Length: 17632, dtype: float64

### Step 12. What is the standard deviation of names?

In [156]:
grouped.agg(np.std)

             Year      Count
Name
Aaban    0.707107   0.000000
Aadan    2.872281   0.957427
Aadarsh       NaN        NaN
Aaden    2.044322  21.154974
Aadhav        NaN        NaN
...           ...        ...
Zyra     2.115701   1.154701
Zyrah    1.414214   0.707107
Zyren         NaN        NaN
Zyria    2.685351   0.737865
Zyriah   2.915476   1.666667

[17632 rows x 2 columns]

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [153]:
grouped.agg([np.mean, np.min,np.max,np.std])

                Year                            Count
                mean  amin  amax       std       mean amin amax        std
Name
Aaban    2013.500000  2013  2014  0.707107   6.000000    6    6   0.000000
Aadan    2009.750000  2008  2014  2.872281   5.750000    5    7   0.957427
Aadarsh  2009.000000  2009  2009       NaN   5.000000    5    5        NaN
Aaden    2010.015306  2005  2014  2.044322  17.479592    5  158  21.154974
Aadhav   2014.000000  2014  2014       NaN   6.000000    6    6        NaN
...              ...   ...   ...       ...        ...  ...  ...        ...
Zyra     2012.142857  2008  2014  2.115701   6.000000    5    8   1.154701
Zyrah    2012.000000  2011  2013  1.414214   5.500000    5    6   0.707107
Zyren    2013.000000  2013  2013       NaN   6.000000    6    6        NaN
Zyria    2008.900000  2005  2014  2.685351   5.900000    5    7   0.737865
Zyriah   2009.666667  2006  2014  2.915476   6.444444    5   10   1.666667

[17632 rows x 8 columns]